app/Controllers/Auth/Login.php

SELECT *
FROM `users`
WHERE `username` = 'hampik'
 LIMIT 1
---
                $username = $this->request->getPost('username');
                $password = $this->request->getPost('password');
                $captcha = $this->request->getPost('captcha');
                $user = $userModel->where('username', $username)->first();