app/Controllers/FamilyChartController.php

    public function generateOrganizationalChart()
    {
        $familyMembers = $this->familyMemberModel->findAll();
        $chartRows = [];

        foreach ($familyMembers as $member) {
            // Get parent ID instead of name for proper hierarchy
            $parentId = null;
            if ($member['parent_id']) {
                $parent = $this->familyMemberModel->find($member['parent_id']);
---
SELECT *
FROM `family_members`
SELECT *
FROM `family_members`
WHERE `family_members`.`id` = '107'