app/Controllers/FamilyListController.php

SELECT *
FROM `family_members`
---
    public function index()
    {
        $data = [
            'title' => 'Family Tree',
            'familyMembers' => $this->familyMemberModel->findAll()

SELECT *
FROM `family_members`
WHERE `family_members`.`id` = '126'
SELECT *
FROM `family_members`
WHERE `family_members`.`id` = '122'
SELECT *
FROM `family_members`
WHERE `family_members`.`id` = 'Léona KOUYOUMJIAN'
SELECT *
FROM `family_members`
WHERE `family_members`.`id` = 'BEZDIKIAN'
SELECT *
FROM `family_members`
WHERE `parent_id` = '126'
OR `mother` = '126'
SELECT *
FROM `family_members`
WHERE `id` != '126'
AND `parent_id` = '122'
---
    public function view($id)
    {
        $member = $this->familyMemberModel->find($id);

        if (!$member) {
//            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound('Family member not found');
            $data=[
                'page_title'      =>'404 - Page not found',
                'main_content'    =>'includes/error_404'
            ];
            return view('layout/main2', $data);
        }

        // Get family relationships
        $parent = $member['parent_id'] ? $this->familyMemberModel->find($member['parent_id']) : null;
        $mother = $member['mother'] ? $this->familyMemberModel->find($member['mother']) : null;
        $spouse = $member['spouse'] ? $this->familyMemberModel->find($member['spouse']) : null;

        // Get children
        $children = $this->familyMemberModel->where('parent_id', $id)
            ->orWhere('mother', $id)
            ->findAll();

        // Get brothers and sisters (same father only)
        $siblings = [];
        if ($member['parent_id']) {
            $siblings = $this->familyMemberModel
                ->where('id !=', $id)
                ->where('parent_id', $member['parent_id'])
                ->findAll();